CF/Catalogs/СоответствиеВидовОплатыСККМOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СоответствиеВидовОплатыСККМOffline</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЭлектроннойОплатыПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеВидовОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВидаОплатыККМOffline</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/СоответствиеВидовОплатыСККМOffline/Ext/ManagerModule.bsl
Функция ПолучитьВидОплатыПоКодуВидаОплатыККМ(СсылкаНаСоответствие, КодВидаОплатыККМ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаСоответствие) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.ВидОплаты КАК ВидОплаты
	|ИЗ
	|	Справочник.СоответствиеВидовОплатыСККМOffline.СоответствиеВидовОплаты КАК СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты
	|ГДЕ
	|	СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.Ссылка = &СсылкаНаСоответствие
	|	И СоответствиеВидовОплатыСККМOfflineСоответствиеВидовОплаты.КодВидаОплатыККМOffline = &КодВидаОплатыККМOffline";
	
	Запрос.УстановитьПараметр("КодВидаОплатыККМOffline", КодВидаОплатыККМ);
	Запрос.УстановитьПараметр("СсылкаНаСоответствие", СсылкаНаСоответствие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ВидОплаты;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
